# St7GetWindowImageFile

Returns the name of the image file used for bgImage and bgImageGradient background modes.

long St7GetWindowImageFile(long uID, char* FileName, long MaxStringLen)

Input Parameters

uID

Strand7 model file ID.

MaxStringLen

Maximum number of characters allocated for FileName.

Output Parameters
FileName

The name of the image file.